Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/moving_country/asylum_seekers_and_refugees/the_asylum_process_in_ireland/eurodac_system.html.txt.tmx
Source language: en
Languages: ga

source: The Eurodac system enables the comparison of fingerprints of asylum applicants and illegal immigrants
ga: Bhunaigh an tAontas Eorpach córas Eurodac chun méarloirg na n-iarrthóirí tearmainn agus na n-inimirceach mídhleathach a chur i gcomparáid

source: The members states of the system are the 28 EU members, Iceland, Norway, Liechtenstein and Switzerland
ga: Is éard is cuspóir leis sa phróiseas tearmainn ná feidhmiú Rialachán Bhaile Átha Cliath III a éascú, a chumasíonn cinneadh an Stáit a bhíonn freagrach as imscrúdú iarratas cosanta idirnáisiúnta

source: The objective of Eurodac in the asylum process is to facilitate the application of the Dublin III Regulation. This Regulation provides a mechanism for determining which country is responsible for examining applications for international protection lodged in one of the member states
ga: Cuireann Rialachán Bhaile Átha Cliath III meicníocht ar fáil chun socrú cén stát atá freagrach as hiarratais ar chosaint idirnáisiúnta a dhéantar i gceann de bhallstáit an Aontais Eorpaigh (AE) a scrúdú

source: In view of the difficulties anticipated in identifying foreign nationals who had already lodged an international protection application in another member state, ministers responsible for immigration agreed in 1991 to establish a system for the comparison of the fingerprints of international protection applicants
ga: D’aontaigh na hAirí freagracha sa bhliain 1991, agus na ballstáit ag dúil le haithint na n-eachtrannach a thaisc iarratas cosanta idirnáisiúnta cheana féin i mballstát éigin eile, córas a bhunú ar fud an Chomhphobail le méarloirg na n-iarrthóirí cosanta idirnáisiúnta a chur i gcomparáid

source: The Eurodac system enables member states to identify asylum seekers and persons who have crossed an external frontier of the European Union in an irregular manner
ga: Cuireann córas Eurodac ar chumas na mballstát iarrthóirí tearmainn agus daoine a aithint a thrasnaigh críoch sheachtrach den AE ar bhealach mí-rialta

source: By comparing fingerprints using Eurodac, member states can determine whether an asylum seeker or a foreign national found illegally present within a member state has previously claimed international protection in another member state
ga: Is féidir leis na ballstáit - trí chomparáid na méarlorg - a chinneadh ar éiligh iarrthóir tearmainn nó náisiúnach eachtrannach a aimsítear le bheith i láthair go mídhleathach laistigh de bhallstát cosaint idirnáisiúnta i mballstát éigin eile

source: Eurodac consists of a Central Unit within the EU Commission, which is equipped with a central database for comparing the fingerprints of asylum applicants and a system for electronic data transmission between member states and the database
ga: Is éard is Eurodac ann ná Láraonad laistigh de Choimisiún an AE a bhfuil bunachar sonraí ar ríomhaire aige le méarloirg na n-iarrthóirí tearmainn a chur i gcomparáid agus córas chun sonraí leictreonacha a tharchur idir ballstáit agus an bunachar sonraí

source: In addition to fingerprints, data sent by member states include the member state of origin (the state sending the data), the place and date of the international protection application (if applicable), the person’s gender and a reference number
ga: I dteannta leis na méarloirg, áireofar go sonrach leis na sonraí a sheolann ballstáit an ballstát bunaidh, áit agus dáta an iarratais chosaint idirnáisiúnta más infheidhmithe, gnéas agus uimhir thagartha

source: Data is collected for anyone over 14 years of age and is encoded directly into the database, either by the Central Unit or by the member state of origin
ga: Tiomsaítear/Bailítear sonraí do dhuine ar bith os cionn 14 bliana d’aois agus códaítear go díreach sa bhunachar sonraí iad ag an Lár-Aonad agus an ballstát bunaidh

source: In the case of asylum seekers, data is kept for 10 years unless the individual obtains the citizenship of one of the member states, when their particulars are immediately erased
ga: I gcás na n-iarrthóirí tearmainn, coinnítear na sonraí ar feadh 10 mbliana mura bhfaigheann an duine aonair saoránacht cheann na mballstát, nuair a léirscriostar a sonraí go láithreach

source: Data relating to foreign nationals apprehended when attempting to cross an external border irregularly is kept for 2 years from the date on which the fingerprints were taken
ga: Coinnítear sonraí na náisiúnach eachtrannach a ghabhtar agus iad ag iarraidh teorainn sheachtracha a thrasnú go mí-rialta ar feadh dhá bhliain ón dáta ónar tugadh na méarloirg

source: Data is immediately erased before the end of 2 years if the foreign national either:
ga: Léirscriostar na sonraí go láithreach ag deireadh an 2 bhliain má:

source: • Receives a residence permit or
ga: • Má fhaigheann an náisiúnach eachtrannach cead cónaithe, nó

source: • Has left the territory of the member states
ga: • Má tá críocha na mBallstát fágtha ina ndiaidh acu

source: In the case of foreign nationals found illegally present within a member state, Eurodac makes it possible to check their fingerprints against those in the central database to determine whether the individual had previously lodged an international protection application in another member state
ga: I gcás na náisiúnach eachtrannach a fhaightear go mídhleathach laistigh de bhallstát, ligeann Eurodac comparáid a dhéanamh idir a méarloirg agus na cinn atá sa bhunachar sonraí lárnach chun a chinntiú an ndearna an duine sin iarratas ar chosaint idirnáisiúnta i mballstát eile cheana féin

source: After the fingerprints have been transmitted for comparison purposes, they are not stored by Eurodac
ga: Tar éis na méarloirg a bheith tarchurtha chun críoch na comparáide, ní stórálann Eurodac a thuilleadh iad

source: As regards the protection of personal data, the member state of origin must ensure that all operations are performed lawfully, such as the taking of fingerprints, as well as all operations involving the use, transmission, conservation or erasure of the data
ga: Maidir le cosaint sonraí pearsanta, ní mór do na ballstáit bhunaidh chun a chinntiú go dtógtar na méarloirg go dlíthiúil chomh maith le hoibríochtaí lena mbaineann úsáid, traschur, caomhnú nó léirscriosadh na sonraí iad féin

source: Application of Eurodac in Ireland
ga: Feidhmiú Eurodac in Éirinn

source: As part of the process of making an application for international protection, you and your dependent minors will be required to have your photograph taken
ga: Beidh ort agus do mhionúir chleithiúnacha bhur ngrianghraf a thógáil mar chuid den phróiseas iarratais ar chosaint idirnáisiúnta

source: You will also be required to have your fingerprints taken
ga: Beidh ort freisin do mhéarlorg a thabhairt

source: Fingerprints of your dependent minors may also be taken
ga: Féadfar méarlorg do mhionúr cleithiúnach a thabhairt freisin

source: Your fingerprints may be disclosed in confidence to the relevant Irish authorities and to international protection authorities of other countries, which may have responsibility for considering your application under the Dublin III Regulation
ga: Féadfar bhur méarlorg a nochtadh faoi rún chuig na húdaráis Éireannacha ábhartha agus chuig údaráis tíortha eile, ag a bhféadfadh freagracht a bheith as d’iarratas a bhreithniú faoi Rialachán Bhaile Átha Cliath III (éascaíonn córas leictreonach - Eurodac - aistriú na faisnéise méarloirg idir tíortha Rialachán Bhaile Átha Cliath III)

source: If you refuse to allow your fingerprints to be taken, you will be deemed not to have made reasonable effort to establish your true identity and to have failed in your duty to co-operate in the investigation of your application
ga: Má dhiúltaíonn tú do thabhairt do mhéarloirg, measfar nach ndearna tú iarracht réasúnta chun d’fhíor-aitheantas a bhunú agus gur theip tú i do dhualgas chun comhoibriú i bhfiosrúchán d’iarratais

source: This may affect the credibility of your application and lead to your application being withdrawn, in which case the Minister for Justice and Equality shall refuse to give you a declaration
ga: D’fhéadfadh sé seo cur isteach ar inchreidteacht d’iarratais agus d'iarratas a stiúradh i dtreo a aistarraingthe, diúltóidh an tAire sa chás sin do dhearbhú a thabhairt duit

source: You should also note that, in accordance with section 20 of the International Protection Act 2015, where an immigration officer or a member of An Garda Síochána, with reasonable cause, suspects that an applicant has not made reasonable effort to establish their identity, they may detain the person concerned
ga: Ba chóir duit a thabhairt faoi deara freisin go bhféadfadh ball den Gharda Síochána, de réir alt 20 na hAchta um Chosaint Idirnáisiúnta 2015, mar a mbíonn siad amhrasach, le cúis réasúnta, faoi iarratasóir nach ndearna sé nó sí iarracht réasúnta a (h)aitheantas a bhunú, go bhféadfaidís an duine i gceist a choinneáil
